---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.IsValid(Autodesk.Revit.DB.Element)
source: html/d765e045-bf6c-68c4-bf57-1514ac22febd.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.IsValid Method

Checks if the element is a valid alignment.

## Syntax (C#)
```csharp
public static bool IsValid(
	Element element
)
```

## Parameters
- **element** (`Autodesk.Revit.DB.Element`) - The element to validate.